<details><summary>Digger run report at 2023-11-06 07:41:19 (UTC)</summary>
              <details><summary>Plan for <b>AppliNH/digger_demo_multienv#dev</b></summary>
  
```terraform
Terraform will perform the following actions:

  # module.dummy_bucket.aws_s3_bucket.s3_bucket will be updated in-place
  ~ resource "aws_s3_bucket" "s3_bucket" {
        id                          = "dummy-bucket-applinh"
      ~ tags                        = {
          + "Environment" = "DEV"
          + "Project"     = "DA-PROJECT"
        }
      ~ tags_all                    = {
          + "Environment" = "DEV"
          + "Project"     = "DA-PROJECT"
        }
        # (9 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────
  ```
</details>

<details><summary>Terraform plan validation check (dev)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details><summary>Locking successful</summary>
  Project AppliNH/digger_demo_multienv#myproject has been locked by PR #2
</details>


<details><summary>Plan for <b>AppliNH/digger_demo_multienv#myproject</b></summary>
  
```terraform
Terraform will perform the following actions:

  # aws_s3_bucket.s3_bucket will be created
  + resource "aws_s3_bucket" "s3_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "dummy"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────
  ```
</details>


<details><summary>Terraform plan validation check (myproject)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details><summary>Plan for <b>AppliNH/digger_demo_multienv#prod</b></summary>
  
```terraform
Terraform will perform the following actions:

  # null_resource.test_prod will be created
  + resource "null_resource" "test_prod" {
      + id = (known after apply)
    }

  # null_resource.test_prod222 will be created
  + resource "null_resource" "test_prod222" {
      + id = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────
  ```
</details>


<details><summary>Terraform plan validation check (prod)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>

</details>